#include <stdio.h>

int main()
{
	int a, b, c;

	//& 按位与，两个都是1，结果为1，否则为0；
	a = 3;
    b = 5;
    //00000011
    //00000101
    //00000001
    printf("a & b = %d \n",a & b);//1
    

    //| 按位或，两个有一个是1，结果为1，否则为0
	//00000011
	//00000101
	//00000111	4+2+1=7
	printf("a | b = %d \n", a | b);//7
	

	//^按位异或，两个不同为1，否则为0
	//00000011
	//00000101
	//00000110 4+2+0=6
	printf("a ^ b = %d\n", a ^ b); //6


	//<< 左移 x<<2,将x的值左移2位，右边空出的2位用0补齐。
	//00000011
	//01100000  2^6+2^5=64+32=96
	printf("a << b = %d\n", a << b); //96

	//>>右移 右移将一个数的各二进制位右移N位，移到右端的低位被舍弃，对于无符号数，高位补0
	//00000011
	//00000000
	printf("a >> b = %d\n", a >> b); //0

	//~取反 1变成0，0变成1
	//00000101
	//00000010
	printf("~ b = %d\n", ~ 5); //4
}